// 리스트 (List)
// 데이터를 따로따로 배치 시키는 것
// 리스트와 배열의 차이
// 같은 종류의 데이터를 배치 시키는 것
// 배열은 크기가 정해져 있다.
// 리스트는 추가 / 삭제가 가능하다.
// 리스트는 분리(가변)되어 있기 때문에 찾아 들어가는 로직이 필요하다.
//
// 필요한 요소
// 컨테이너와 노드(데이터와 링크정보)
//
// 컨테이너 : 리스트 전체를 관리하는 공간
// 리스트가 한 개가 아닌 여러개를 만들 수 있기 때문에 컨테이너라는 개념이 필요하다.
//
// 노드 : 리스트를 구성하고 있는 기초적인 제일 작은 단위
// 떨어져있는 데이터를 연결하기 위한 연결정보를 두 개를 저장한다.
//
// 데이터들의 인덱스 정보를 따로 관리하는 메서드
// 추가하고 삭제하는 메서드 (앞, 뒤 또는 원하는 인덱스)
//
// 구상
// 데이터 블록 하나 당 [3] 배열로 [0]은 데이터 [1], [2]은 옆의 노드정보, 뒤의 노드정보

package com.algorithm.my.list;

import com.algorithm.my.list.*;

public class Index {

	public static void main(String[] args) {
		
		

	}

}
