/**
 * 
 *	● 리스트 (List)
 *	- 데이터를 분산하여 배치한다.
 *	- 리스트 종류로는 Array-list, Single Linked-list, Double Linked-list가 있다.
 *
 *	● 배열과 리스트 비교
 *	
 *	- 배열
 *	사이즈가 정해져 있다.
 *  같은 종류의 데이터를 배치한다.
 *	
 *	- 리스트
 *	사이즈의 할당 없이, 가변적 데이터 삽입이 가능하다.
 *	각 데이터들이 분리되어 있기 때문에 연결정보(노드) 로직이 필요하다.
 *
 *	● 리스트 필요 요소
 *
 *	1. 컨테이너
 *	다수의 리스트를 만들수 있도록 리스트를 관리하는 프레임 구성이 필요하다.
 * 
 *	2. 노드
 *	리스트를 구성하고 있는 기초적인 제일 작은 단위다.
 *	떨어져있는 데이터를 연결하기 위한 연결정보를 두 개를 저장한다.
 *
 *	3. 데이터
 *	노드에 저장될 데이터를 정의하는 로직이다.
 * 
 */

package com.algorithm.my.list;

public class Index
{
	public static void main(String[] args)
	{
		
	}

}
